{
    "version": "https://jsonfeed.org/version/1",
    "title": "Eryxian ",
    "description": "",
    "home_page_url": "https://eryxian.com",
    "feed_url": "https://eryxian.com/feed.json",
    "user_comment": "",
    "icon": "https://eryxian.com/media/website/eryxian-newsmall-logo.png",
    "author": {
        "name": "Eryx Games"
    },
    "items": [
        {
            "id": "https://eryxian.com/public-beta-of-eryx-tcg-new-factions-and-strategies.html",
            "url": "https://eryxian.com/public-beta-of-eryx-tcg-new-factions-and-strategies.html",
            "title": "Public Beta of Eryxian TCG: New Factions and Strategies",
            "summary": "Calling All Sci-Fi Strategists: Eryxian TCG Enters Open Beta with New Content and Platforms! Attention spacefarers and fantasy warriors! Buckle up and prepare&hellip;",
            "content_html": "\n    <h2 id=\"calling-all-sci-fi-strategists-eryxian-tcg-enters-open-beta-with-new-content-and-platforms\">\n      Calling All Sci-Fi Strategists: Eryxian TCG Enters Open Beta with New Content and Platforms!\n    </h2>\n\n  <p>\n    Attention spacefarers and fantasy warriors! Buckle up and prepare to unleash your inner card battler, because the innovative sci-fi/fantasy card game Eryxian TCG is boldly venturing into open beta! This exciting phase marks a significant leap forward for Eryx, introducing a wave of fresh content, novel card effects, and expanded accessibility across multiple platforms.<br><br>The Eryxian TCG open beta throws open the digital doors to duelists on Android, Linux, and Windows devices (iOS / iPadOS versions will follow). This means more players can join the exhilarating strategic clashes that blend futuristic technology with fantastical creatures. Whether you're a seasoned card game veteran or a curious newcomer, the Eryxian TCG open beta offers the perfect opportunity to delve into its deep strategic gameplay and explore the unique blend of genres. So, assemble your deck, refine your tactics, and prepare to dominate the battlefield as Eryxian TCG embarks on this new chapter!\n  </p>\n\n    <h2 id=\"will-you-succumb-to-the-madness-or-will-you-forge-your-own-dark-legend-in-the-face-of-cosmic-dreadandnbsp\">\n      Will you succumb to the madness, or will you forge your own dark legend in the face of cosmic dread?&nbsp;\n    </h2>\n\n  <p>\n    For those eager to delve deeper, be sure to check out the development notes outlining the latest additions and upcoming features together with concept artworks and designs.&nbsp;\n  </p>",
            "image": "https://eryxian.com/media/posts/6/eryxian_game_beta.png",
            "author": {
                "name": "Eryx Games"
            },
            "tags": [
            ],
            "date_published": "2024-06-11T17:39:08+02:00",
            "date_modified": "2024-08-02T17:12:21+02:00"
        },
        {
            "id": "https://eryxian.com/eryx-design-the-game-world.html",
            "url": "https://eryxian.com/eryx-design-the-game-world.html",
            "title": "Eryxian: Design the Game World",
            "summary": "Worldbuilding for science fiction game.&nbsp; Players can create their own cards using provided Rules &amp; Lore Book (for Print2Play Edition), using own graphics&hellip;",
            "content_html": "\n  <p>\n    Worldbuilding for science fiction game.&nbsp;\n  </p>\n\n    <h2 id=\"eryxian-tcg-deckbuilding-card-game-online-edition\">\n      ERYXIAN TCG (Deckbuilding Card Game): Online Edition\n    </h2>\n\n  <ul>\n    <li>Duel deckbuilding card game for 2 players\n</li><li>Can be played from custom decks as online CCG (Collectible Card Game) or as an offline solo adventure with a storyline</li>\n  </ul>\n\n  <p>\n    Players can create their own cards using provided Rules &amp; Lore Book (for Print2Play Edition), using own graphics or provided template graphics and/or custom AI model for card generation\n  </p>\n\n    <h2 id=\"eryxian-a-lovecraftian-fable\">\n      ERYXIAN: A Lovecraftian Fable\n    </h2>\n\n  <p>\n    On the fringe of explored space, where the tendrils of charted civilization fray into the unknown, lies the desolate planet Eryx. Scarred by the Collective conflict, humankind seek resources for a battered Earth. Extraterrestrial Reconnaissance &amp; Yield Xenobiology (ERYX) project is found and sent to reestablish outposts, mining facilities and xenoarcheology sites on the planet and its two moons. But Eryx holds a sinister truth.\n<br>\n<br>Here, twisted flora and fauna serve the enigmatic Eryxians, while brutal Collective's extermination units are establishing its presence on the planet. The struggle for resources once hardened humanity, but the darkness of Eryx twists their resolve. Now, they fight not just for survival, but against the insidious whispers that threaten to corrupt their very souls.\n<br>\n<br>Whispers of the Ancients, cosmic horrors from beyond the stars, fuel the planet's malevolent aura. Can humanity survive this desolate crucible, or will they succumb to the madness within Eryx's ancient ruins?\n<br>\n\n  </p>\n\n    <h2 id=\"eryxian-factions\">\n      ERYXIAN: Factions\n    </h2>\n\n  <ul>\n    <li>Humans\n</li><li>Collective\n</li><li>Eryxians\n</li><li>Ancients</li>\n  </ul>\n\n  <p>\n    Eryx. A name whispered on a thousand barren worlds, a beacon of luminescence in the unforgiving expanse. Its emerald bioluminescent flora pulsed beneath a perpetual twilight sky, painting the landscape in an alien tapestry. Colossal, crystalline lifeforms pierced the clouds, their surfaces etched with arcane symbols that defied comprehension. Here, fantastical creatures stalked the twilight jungle, their forms a bizarre fusion of familiar and alien. Yet, this strange beauty masked a deeper mystery. The Eryxians, an ancient race shrouded in legend, were said to possess psionic abilities that rivaled the gods themselves. Their enigmatic cities, half-buried by the encroaching jungle, pulsed with an unseen energy, a testament to a forgotten glory. You stand at the precipice of this world, a lone operative amidst the whispering secrets of Eryn.  Will you venture forth as a hardened human recon soldier, a stoic member of the robotic collective, or perhaps, a descendant of the Eryxians themself, awakened to a forgotten legacy? The choice is yours, operative. The fate of Eryx hangs in the balance.\n  </p>\n\n  <p>\n    Your descent through Eryx's atmosphere jolted you awake. The rickety dropship groaned in protest, the viewscreen flickering with glimpses of the alien landscape rushing towards you. A klaxon blared, red emergency lights bathing the cramped interior in an ominous glow. The pilot, a grizzled veteran with a cybernetic eye, barked orders over the comms. \"Unidentified energy signature detected! Brace for hard landing!\"<br><br>The impact sent you sprawling. Disoriented, you clambered from the wreckage, the alien air thick and humid. Strange chittering sounds echoed from the jungle, and a bioluminescent vine whipped past your face, its touch sending a jolt through your nervous system.  This wasn't just any recon mission. This was a descent into the unknown, a chance to unravel the mysteries of Eryx and its enigmatic inhabitants. The question gnawed at you - were the Eryxians allies, or a forgotten power waiting to be awakened?  As you scanned your surroundings, the weight of your decision settled on your shoulders. The fate of the mission, and perhaps Eryx itself, rested on your choice.\n  </p>\n\n  <p>\n    You checked your gear, the familiar weight of your weapon a grounding comfort in this alien world. Glancing at the flickering console on your wrist, you reviewed the mission parameters. Your objective: locate the source of the unidentified energy signature and assess potential threats. But the harsh reality was this - you were a single operative on a hostile planet, with a wrecked dropship and a gnawing sense of unease.<br><br>Three paths diverged before you. To the north, the dense jungle canopy pulsed with an unnatural bioluminescence, promising both danger and potential answers. To the west, the ruins of a colossal Eryxian city shimmered in the twilight, a testament to a lost civilization. And to the east, a faint metallic hum resonated through the air, hinting at a technology both alien and strangely familiar.<br><br>Which path would you choose, operative?<br><br><strong>Human Recon Soldier or Scientist: </strong>Driven by a soldier's pragmatism, you head for the wreckage, hoping to salvage emergency supplies and establish communication. Perhaps the pilot survived, or the ship's black box holds the key to your predicament.<br><strong>Robotic Collective Unit:</strong> Your primary directive is to gather data and assess potential threats. The humming sound to the east draws you in, a beacon of technological curiosity amidst the organic chaos.<br><strong>Descendant of the Eryxians: </strong>A primal pull beckons you towards the ruined city. Perhaps the energy signature is a remnant of your people's forgotten power, a call to awaken a dormant legacy within you.\n  </p>",
            "image": "https://eryxian.com/media/posts/2/eryxgame-illustration01.png",
            "author": {
                "name": "Eryx Games"
            },
            "tags": [
            ],
            "date_published": "2024-05-18T16:52:00+02:00",
            "date_modified": "2024-08-02T17:13:37+02:00"
        },
        {
            "id": "https://eryxian.com/the-story-of-eryx-a-lovecraftian-fable.html",
            "url": "https://eryxian.com/the-story-of-eryx-a-lovecraftian-fable.html",
            "title": "The Story of Eryx: A Lovecraftian Fable",
            "summary": "On the desolate wasteland and jungles of Eryx, humanity clings to survival. Frail scientist-scavengers and hardened military outposts scrape for resources - luminous&hellip;",
            "content_html": "\n  <p>\n    On the desolate wasteland and jungles of Eryx, humanity clings to survival. Frail scientist-scavengers and hardened military outposts scrape for resources - luminous crystals and enigmatic artifacts - amidst the ruins of the once-great Eryxian civilization. But they're not alone. The rogue AI Collective, cyborgs obsessed with uploading their consciousness into the code rumored to lie within the ruins, stalks the shadows. The Eryxians, enigmatic beings who control the planet's hostile flora and fauna, jealously guard their secrets. And looming over it all are whispers of the Ancients, malevolent gods from beyond the stars, whose hunger for souls threatens to consume everything. In this desperate struggle for survival and forbidden knowledge, who will claim dominion over the broken remnants of Eryx?<br>\n  </p>",
            "author": {
                "name": "Eryx Games"
            },
            "tags": [
                   "stories"
            ],
            "date_published": "2024-05-17T18:00:00+02:00",
            "date_modified": "2024-08-04T20:12:31+02:00"
        },
        {
            "id": "https://eryxian.com/development-and-worldbuilding-gallery.html",
            "url": "https://eryxian.com/development-and-worldbuilding-gallery.html",
            "title": "Development and Worldbuilding Gallery",
            "summary": "This gallery serves as a portal to the development process of Eryx world, offering a trove of concept art, sketches, and 3D models&hellip;",
            "content_html": "\n  <p>\n    This gallery serves as a portal to the development process of Eryx world, offering a trove of concept art, sketches, and 3D models that bring this universe to life. Witness the evolution of Eryx's environments, from desolate landscapes to haunting ruins, creatures and technologies, all teeming with the potential for both wonder and terror. This gallery is a constant work in progress, just like the world of Eryx itself. We'll continue to unveil new concepts and designs, offering you a front-row seat to the creative process. Stay tuned, for there's much more to uncover in the depths of Eryx.\n  </p>\n\n  <p>\n    This gallery is for curious players, sci-fi/fantasy enthusiasts, design aficionados, and anyone eager to know more about the concept art. Dive into the desolate landscapes and haunting ruins of Eryx, meet its diverse inhabitants, and witness the intricate worldbuilding come to life. Explore the gallery, and don't forget to follow us on X-Twitter and YouTube for the latest news, insightful tutorials on concept art and design techniques, and thrilling gameplay videos that will prepare you for your descent into the mysteries and adventure of Eryx!<br>\n  </p>\n\n  <div  class=\"gallery-wrapper\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://eryxian.com/media/posts/7/gallery/eryxian-promoimage-sketch.png\" data-size=\"527x461\">\n        <img loading=\"lazy\" src=\"https://eryxian.com/media/posts/7/gallery/eryxian-promoimage-sketch-thumbnail.png\" height=\"461\" width=\"527\" alt=\"Eryxian Civilizations Concept Art\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://eryxian.com/media/posts/7/gallery/eryxian-gallery.png\" data-size=\"1536x1152\">\n        <img loading=\"lazy\" src=\"https://eryxian.com/media/posts/7/gallery/eryxian-gallery-thumbnail.png\" height=\"540\" width=\"720\" alt=\"Eryxian Card Game Concept Art\" >\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://eryxian.com/media/posts/7/gallery/itch-eryxian-promo4.png\" data-size=\"630x500\">\n        <img loading=\"lazy\" src=\"https://eryxian.com/media/posts/7/gallery/itch-eryxian-promo4-thumbnail.png\" height=\"500\" width=\"630\" alt=\"Eryxian Civilizations  Card Game Alien Species Concept Art\" >\n      </a>\n      \n    </figure>\n    </div>\n  </div>",
            "author": {
                "name": "Eryx Games"
            },
            "tags": [
            ],
            "date_published": "2024-05-16T17:56:00+02:00",
            "date_modified": "2024-08-04T20:10:30+02:00"
        },
        {
            "id": "https://eryxian.com/eryx-tcg-alpha.html",
            "url": "https://eryxian.com/eryx-tcg-alpha.html",
            "title": "Eryxian TCG Pre-Alpha",
            "summary": "\n  <p>\n    Gear Up, Explorers, Eryx Descends on Android! The pre-alpha for Eryxian, the chilling deckbuilding card game, is here! Dive into a world of cosmic horror and experience early gameplay mechanics.&nbsp;Be among the first to explore the enigmatic world and encounter its lurking horrors. Lear more about the game world on <a href=\"https://github.com/eryxgames/Eryxian/wiki\" target=\"_blank\" rel=\"nofollow noopener\">Eryxian Wiki</a>.&nbsp;\n  </p>\n",
            "content_html": "\n  <p>\n    Gear Up, Explorers, Eryx Descends on Android! The pre-alpha for Eryxian, the chilling deckbuilding card game, is here! Dive into a world of cosmic horror and experience early gameplay mechanics.&nbsp;Be among the first to explore the enigmatic world and encounter its lurking horrors. Lear more about the game world on <a href=\"https://github.com/eryxgames/Eryxian/wiki\" target=\"_blank\" rel=\"nofollow noopener\">Eryxian Wiki</a>.&nbsp;\n  </p>\n\n\n    <h2 id=\"descendant-of-the-eryxians\">\n      Descendant of the Eryxians\n    </h2>\n\n  <p>\n    The pull towards the ruined city was undeniable. It wasn't just a logical choice, it was a thrumming in your very being, a song sung in a language your ancestors spoke but your conscious mind had forgotten. Ignoring the warnings flashing on your neural interface about the dangers of venturing into unknown territory, you set off towards the west.\n  </p>\n\n  <p>\n    The jungle thinned as you neared the city, replaced by a desolate landscape of cracked earth and shattered crystal formations. The air crackled with a faint electrical energy, making the hairs on your arms stand on end. As you approached the city gates, colossal structures etched with swirling glyphs loomed before you. The glyphs shimmered with an inner light, pulsing in rhythm with the energy signature you were tracking.<br><br>A strange sense of familiarity washed over you as you placed your hand on the cool surface of the gate. The glyphs flared, bathing you in a blinding white light. When your vision cleared, you found yourself standing not outside the city, but within. The once grand halls were overgrown with strange, bioluminescent vines, and the air hung heavy with the scent of decay. Yet, amidst the ruins, there was a hum of residual power, a whisper of a glorious past.<br><br>Suddenly, a voice echoed through your mind, a voice both ancient and strangely comforting. It spoke in a language you didn't understand, yet somehow comprehended. It spoke of a forgotten legacy, of a dormant power waiting to be awakened. The voice urged you to venture deeper, to the heart of the city, where the true source of the energy signature lay.\n  </p>\n\n    <h2 id=\"do-you\">\n      Do you:\n    </h2>\n\n  <p>\n    <strong>Follow the voice:</strong> Driven by the promise of awakening your forgotten heritage, you delve deeper into the ruined city, following the voice's guidance. <strong>(download the game)</strong><br><strong>Investigate the source of the voice: </strong>While the voice seems benevolent, you remain cautious. You decide to locate the source of the voice before blindly following its instructions.<strong> (see rulebook)</strong>\n  </p>\n\n  <p class=\"msg msg--warning\">\n    While the voice seems benevolent, you remain cautious. You decide to locate the source of the voice before blindly following its instructions.\n  </p>",
            "image": "https://eryxian.com/media/posts/1/eryxian-titlepageeryxalpha2b.png",
            "author": {
                "name": "Eryx Games"
            },
            "tags": [
            ],
            "date_published": "2024-05-14T16:45:15+02:00",
            "date_modified": "2025-02-26T15:12:29+01:00"
        }
    ]
}
